<a href="https://colab.research.google.com/github/grbarbosa3/Pandas_lecture/blob/master/Criando_DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Criando DataFrames**
com Pandas

In [0]:
import pandas as pd

## **Criando DataFrame a partir de Dicionários**

In [0]:
# DICIONARIO

dados_dict = {
   
    "nome" : ["Gui","Pai","Mãe", "Billy", "Dinky"],
    "idade" : [26,11,7,55,54],
    "lugar" : ["Mesa","Cozinha", "Costura", "Sofá", "Caminha"],
    "onde" : [True, False, True, False, False]

}

In [18]:
dados_dict.keys()

dict_keys(['nome', 'idade', 'lugar', 'onde'])

In [19]:
dados_dict.values()

dict_values([['Gui', 'Pai', 'Mãe', 'Billy', 'Dinky'], [26, 11, 7, 55, 54], ['Mesa', 'Cozinha', 'Costura', 'Sofá', 'Caminha'], [True, False, True, False, False]])

In [44]:
#criar um Data Frame apartir do dicionário

df = pd.DataFrame(dados_dict)
df

    nome  idade    lugar   onde
0    Gui     26     Mesa   True
1    Pai     11  Cozinha  False
2    Mãe      7  Costura   True
3  Billy     55     Sofá  False
4  Dinky     54  Caminha  False

**Associando 'id de usuário' ao DataFrame**

In [0]:
id_usuario = [314, 929, 872, 514, 815]

In [23]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [0]:
df.index = id_usuario

In [28]:
df

      nome  idade    lugar   onde
314    Gui     26     Mesa   True
929    Pai     11  Cozinha  False
872    Mãe      7  Costura   True
514  Billy     55     Sofá  False
815  Dinky     54  Caminha  False

**Chamando id**

In [30]:
df.loc[314]

nome      Gui
idade      26
lugar    Mesa
onde     True
Name: 314, dtype: object

# **Criando DataFrame a partir de listas**

In [0]:
# LISTA

dados_Lista = [
               ["Gui",26,"Mesa",True],
               ["Billy", 12, "Sofá", False],
               ["Dinky", 7, "Caminha",False],
               ["Mae",54, "Costura", True],
               ["Pai",55, "Cozinha", True]
]

In [0]:
df_2 = dados_Lista

In [34]:
df_2

[['Gui', 26, 'Mesa', True],
 ['Billy', 12, 'Sofá', False],
 ['Dinky', 7, 'Caminha', False],
 ['Mae', 54, 'Costura', True],
 ['Pai', 55, 'Cozinha', True]]

## **Transformando a lista em Data Frame** **e adicionando *Index**

In [0]:
df_2 = pd.DataFrame(dados_Lista, columns=['nome','idade','local','onde'])
df_2.index = ['a','b','c','d','e']

In [39]:
df_2

    nome  idade    local   onde
a    Gui     26     Mesa   True
b  Billy     12     Sofá  False
c  Dinky      7  Caminha  False
d    Mae     54  Costura   True
e    Pai     55  Cozinha   True

In [41]:

df_2.loc['c']

nome       Dinky
idade          7
local    Caminha
onde       False
Name: c, dtype: object

**Adicionando a coluna 'Saldo'**

In [0]:
#criar coluna

df_2['saldo'] = 0.0

In [43]:
df_2

    nome  idade    local   onde  saldo
a    Gui     26     Mesa   True    0.0
b  Billy     12     Sofá  False    0.0
c  Dinky      7  Caminha  False    0.0
d    Mae     54  Costura   True    0.0
e    Pai     55  Cozinha   True    0.0